АлогистикТест2/src/DataProcessors/алк_РМ_ПривязкаПакетовКАддендуму/алк_РМ_ПривязкаПакетовКАддендуму.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_РМ_ПривязкаПакетовКАддендуму</name>
  <attributes>
    <name>Аддендум</name>
    <type>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПроизводству</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>127</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отгружено</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Произведено</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пакеты</name>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Новый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Отгружено</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийАддендум</name>
      <type>
        <types>DocumentRef.алк_Аддендумы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

АлогистикТест2/src/AccumulationRegisters/алк_Аддендумы/алк_Аддендумы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_Аддендумы</name>
  <comment>Регистр показывает сколько требуется произвести и отгрузить по заказу</comment>
  <resources>
    <name>КПроизводству</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </resources>
  <resources>
    <name>Произведено</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Аддендум</name>
    <type>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПакетыПоАддендумам/алк_ПакетыПоАддендумам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПакетыПоАддендумам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Аддендум</name>
    <type>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_ОстаткиЗапасов/алк_ОстаткиЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОстаткиЗапасов</name>
  <resources>
    <name>Количество</name>
    <comment>Для пиловочника и пилмата это объем, для ДГ это вес</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Documents/алк_Аддендумы/алк_Аддендумы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_Аддендумы</name>
  <comment>Уточнение договора на поставку товаров клиенту</comment>
  <registerRecords>AccumulationRegister.алк_Аддендумы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.алк_СтатусыАддендума</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУсловийПоставки</name>
    <type>
      <types>CatalogRef.алк_УсловияПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАддендума</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАддендума</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененияЗапрещены</name>
    <comment>Устанавливают после регистрации в ЛесЕГАИС</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаРазрешена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>127</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеВручную</name>
      <comment>Если Да - пользователь вводит руками, если нет - перезаполняется по нашим алгоритмам</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияПЭО</name>
      <type>
        <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставТоваров</name>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолщинаОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолщинаДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаОт</name>
      <comment>Длина в миллиметрах</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаДо</name>
      <comment>Длина в миллиметрах</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВлажностьОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВлажностьДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПрипуска</name>
      <type>
        <types>CatalogRef.алк_ВариантыПрипуска</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/DataProcessors/алк_РМ_ПривязкаПакетовКАддендуму/Forms/РМ/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Участок) Тогда
		//Заполним ДатаСмены и Смена автоматом
		ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Объект.Участок);
		
		Если ПараметрыСменыПоТекущейДате = NULL Тогда
			Объект.Участок = Справочники.алк_Участки.ПустаяСсылка();
			Возврат;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыСменыПоТекущейДате, "ДатаСмены, Смена");		
	КонецЕсли;
	
	Объект.Операция = Справочники.алк_ОперацииПроизводства.Отгрузка;
	Объект.Номенклатура = Объект.Участок.НоменклатураСписания;

КонецПроцедуры

&НаКлиенте
Процедура ЦехПриИзменении(Элемент) 
	
	Объект.Товары.Очистить();
	ПриОткрытииНаСервере(); 
	Если ЗначениеЗаполнено(Объект.Номенклатура) И ЗначениеЗаполнено(Объект.Аддендум) Тогда 
		Если Объект.Номенклатура <> ПолучитьНоменклатуруИзАддендума(Объект.Аддендум) Тогда 
			Объект.Аддендум = ПредопределенноеЗначение("Документ.алк_Аддендумы.ПустаяСсылка"); 
		КонецЕсли;
	КонецЕсли; 	
	
	//НовыйПараметр = Новый ПараметрВыбора("Номенклатура", Объект.Номенклатура);
	//
	//НовыйМассив = Новый Массив();
	//НовыйМассив.Добавить(НовыйПараметр);
	//
	//НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);	
	//
	//Элементы.Аддендум.ПараметрыВыбора = НовыеПараметры;
	
	АддендумПриИзмененииНаСервере(); 
	ПересчитатьИтогиПодобраныйПакетов();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНоменклатуруИзАддендума(Аддендум)
	
	Возврат Аддендум.Товары[0].Номенклатура;
	
КонецФункции

&НаСервере
Процедура АддендумПриИзмененииНаСервере()
	
	Объект.Товары.Очистить();
	Объект.Пакеты.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_АддендумыТовары.ПредставлениеТовара КАК ПредставлениеТовара,
		|	алк_АддендумыТовары.Номенклатура КАК Номенклатура,
		|	алк_АддендумыТовары.ИдентификаторТовара,
		|	СУММА(алк_АддендумыТовары.Количество) КАК Заказано
		|ПОМЕСТИТЬ ВТ_КПроизводству
		|ИЗ
		|	Документ.алк_Аддендумы.Товары КАК алк_АддендумыТовары
		|ГДЕ
		|	алк_АддендумыТовары.Ссылка = &Аддендум
		|	И алк_АддендумыТовары.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_АддендумыТовары.Номенклатура,
		|	алк_АддендумыТовары.ПредставлениеТовара,
		|	алк_АддендумыТовары.ИдентификаторТовара
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_АддендумыОбороты.Аддендум,
		|	алк_АддендумыОбороты.ИдентификаторТовара,
		|	СУММА(алк_АддендумыОбороты.КПроизводствуРасход) КАК КПроизводству,
		|	СУММА(алк_АддендумыОбороты.КОтгрузкеРасход) КАК КОтгрузке
		|ПОМЕСТИТЬ ВТ_Расход
		|ИЗ
		|	РегистрНакопления.алк_Аддендумы.Обороты(, , , Аддендум = &Аддендум) КАК алк_АддендумыОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_АддендумыОбороты.Аддендум,
		|	алк_АддендумыОбороты.ИдентификаторТовара
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КПроизводству.ИдентификаторТовара КАК ИдентификаторТовара,
		|	ВТ_КПроизводству.ПредставлениеТовара КАК ПредставлениеТовара,
		|	ВТ_КПроизводству.Номенклатура КАК Номенклатура,
		|	СУММА(ВТ_КПроизводству.Заказано) КАК КПроизводству,
		|	СУММА(ВТ_Расход.КПроизводству) КАК Произведено,
		|	СУММА(ВТ_Расход.КОтгрузке) КАК Отгружено
		|ИЗ
		|	ВТ_КПроизводству КАК ВТ_КПроизводству
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Расход КАК ВТ_Расход
		|		ПО ВТ_КПроизводству.ИдентификаторТовара = ВТ_Расход.ИдентификаторТовара
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_КПроизводству.ИдентификаторТовара,
		|	ВТ_КПроизводству.Номенклатура,
		|	ВТ_КПроизводству.ПредставлениеТовара";
	
	Запрос.УстановитьПараметр("Аддендум", Объект.Аддендум);
	//Запрос.УстановитьПараметр("СкладУчастка", Объект.Участок.СкладСписания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрТовара = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрТовара, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	//Заполним уже привязаные пакеты, исключая отвязанные
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер,
		|	алк_ПакетыПоАддендумамСрезПоследних.ИдентификаторТовара,
		|	СУММА(ВЫБОР
		|			КОГДА алк_ПакетыПоАддендумамСрезПоследних.ПоОтгрузке
		|				ТОГДА алк_ПакетыПоАддендумамСрезПоследних.Количество
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Отгружено,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ алк_ПакетыПоАддендумамСрезПоследних.ПоОтгрузке
		|				ТОГДА алк_ПакетыПоАддендумамСрезПоследних.Количество
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Количество,
		|	ЛОЖЬ КАК Новый
		|ИЗ
		|	РегистрСведений.алк_ПакетыПоАддендумам.СрезПоследних(, Аддендум = &Аддендум) КАК алк_ПакетыПоАддендумамСрезПоследних
		|ГДЕ
		|	НЕ алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер В
		|				(ВЫБРАТЬ
		|					ВложенныйЗапрос.СерийныйНомер
		|				ИЗ
		|					(ВЫБРАТЬ ПЕРВЫЕ 1
		|						алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер КАК СерийныйНомер,
		|						алк_ПакетыПоАддендумамСрезПоследних.Аддендум КАК Аддендум
		|					ИЗ
		|						РегистрСведений.алк_ПакетыПоАддендумам.СрезПоследних(, СерийныйНомер В
		|							(ВЫБРАТЬ
		|								алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер
		|							ИЗ
		|								РегистрСведений.алк_ПакетыПоАддендумам.СрезПоследних(, Аддендум = &Аддендум) КАК алк_ПакетыПоАддендумамСрезПоследних)) КАК алк_ПакетыПоАддендумамСрезПоследних
		|					УПОРЯДОЧИТЬ ПО
		|						алк_ПакетыПоАддендумамСрезПоследних.Период УБЫВ) КАК ВложенныйЗапрос
		|				ГДЕ
		|					ВложенныйЗапрос.Аддендум = ЗНАЧЕНИЕ(Документ.алк_Аддендумы.ПустаяСсылка))
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер,
		|	алк_ПакетыПоАддендумамСрезПоследних.ИдентификаторТовара"; 	
		
	Запрос.УстановитьПараметр("Аддендум", Объект.Аддендум);  
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрПакет = Объект.Пакеты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрПакет, ВыборкаДетальныеЗаписи);
	КонецЦикла; 
					
КонецПроцедуры

&НаКлиенте
Процедура АддендумПриИзменении(Элемент)
	Если ПроверитьЗаполнение() Тогда	
		АддендумПриИзмененииНаСервере();  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодборНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда) 
	
	ОчиститьСообщения(); 
	
	Если ЗначениеЗаполнено(Объект.Аддендум) Тогда
		
		Если Элементы.Товары.ТекущиеДанные <> Неопределено Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("РежимВыбора"			, Истина);
			ПараметрыФормы.Вставить("МножественныйВыбор"	, Истина);
			ПараметрыФормы.Вставить("ЗакрыватьПриВыборе"	, Ложь);
			ПараметрыФормы.Вставить("Аддендум"				, Объект.Аддендум);
			ПараметрыФормы.Вставить("ИдентификаторТовара"	, Элементы.Товары.ТекущиеДанные.ИдентификаторТовара);
			ПараметрыФормы.Вставить("Номенклатура"			, Элементы.Товары.ТекущиеДанные.Номенклатура);
			
			ОткрытьФорму("Обработка.алк_РМ_ПривязкаПакетовКАддендуму.Форма.ФормаПодбораПакетов", ПараметрыФормы, ЭтаФорма);
		Иначе
			Сообщить("Для подбора необходимо выделить строку из состава");	
		КонецЕсли;
		
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора",Истина);
		ПараметрыФормы.Вставить("МножественныйВыбор",Истина);
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",ложь);
		ПараметрыФормы.Вставить("ТолькоСОстатками", Истина);
		
		ОткрытьФорму("Справочник.СерийныеНомера.ФормаВыбора",ПараметрыФормы,ЭтаФорма);
		
	КонецЕсли;
	
	
	
КонецПроцедуры

//Процедура ПослеЗакрытияФормыПодбора()
//	
//КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	
	ВыбранныеПакеты = ПолучитьСтруктуруОстатковПакетов(ВыбранноеЗначение);
	Для Каждого Пакет Из ВыбранныеПакеты Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("СерийныйНомер", Пакет.СерийныйНомер);
		НайденныеСтроки = Объект.Пакеты.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 тогда
			Сообщить(СтрШаблон("В табличной части уже имеется серийный номер %1", Пакет.СерийныйНомер));	
		Иначе				
			НовыйПакет = Объект.Пакеты.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйПакет, Пакет);
			НовыйПакет.ИдентификаторТовара = ?(Элементы.Товары.ТекущиеДанные = Неопределено, "",Элементы.Товары.ТекущиеДанные.ИдентификаторТовара);	
			НовыйПакет.Новый = Истина;
			НовыйПакет.ТекущийАддендум = ПолучитьТекАддендум(Пакет.СерийныйНомер);	
		КонецЕсли;		 
	КонецЦикла;
	
	ОбновитьТЧПодобранныхПакетов();	
	
	Модифицированность = Истина;
	
	
КонецПроцедуры 

Функция ПолучитьТекАддендум(СерийныйНомер)
	СтруктураАддендума = РегистрыСведений.алк_ПакетыПоАддендумам.ПолучитьАддендумИСтатусПоОтгрузкеПоСерийномуНомеруНаДату(СерийныйНомер); 
	
	Если СтруктураАддендума = Неопределено Тогда 
		Возврат ПредопределенноеЗначение("Документ.алк_Аддендумы.ПустаяСсылка"); 
	КонецЕсли; 
	
	Возврат СтруктураАддендума.Адд;
КонецФункции

Функция ПолучитьСтруктуруОстатковПакетов(ВыбранноеЗначение)
	Возврат РегистрыНакопления.алк_ОстаткиЗапасов.ПолучитьСтруктуруОстатковПакетов(ВыбранноеЗначение);	
КонецФункции

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	ОбновитьТЧПодобранныхПакетов();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТЧПодобранныхПакетов()
	Если Элементы.Товары.ТекущиеДанные <> Неопределено Тогда
		Элементы.ПодобранныеПакеты.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторТовара", Элементы.Товары.ТекущиеДанные.ИдентификаторТовара);  
		ПересчитатьИтогиПодобраныйПакетов();
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ПересчитатьИтогиПодобраныйПакетов()
	
	//надо заполнить ИтогПоОтборуПакетов
	
	ИтогПоОтборуПроизведено = 0;
	ИтогПоОтборуОтгружено = 0;
	
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		
		Для Каждого Стр Из Объект.Пакеты Цикл
			ИтогПоОтборуПроизведено = ИтогПоОтборуПроизведено + Стр.Количество;	
			ИтогПоОтборуОтгружено = ИтогПоОтборуОтгружено + Стр.Отгружено;
		КонецЦикла;
		
	Иначе 
		
		СтруктураОтбора = Новый Структура("ИдентификаторТовара", Элементы.Товары.ТекущиеДанные.ИдентификаторТовара);
		
		ОтобранныеПоИдентификатору = Объект.Пакеты.НайтиСтроки(СтруктураОтбора);
		Для Каждого Стр Из ОтобранныеПоИдентификатору Цикл
			ИтогПоОтборуПроизведено = ИтогПоОтборуПроизведено + Стр.Количество;	
			ИтогПоОтборуОтгружено = ИтогПоОтборуОтгружено + Стр.Отгружено;
		КонецЦикла;		
		
	КонецЕсли;	
	
КонецПроцедуры
	
&НаСервере
Процедура СохранитьНаСервере()
	Успех = Истина;
	
	НачатьТранзакцию(); 
	Попытка	
		Для Каждого Стр Из Объект.Пакеты Цикл
			Если Стр.Новый Тогда
				ПараметрыЗаполнения = Документы.алк_ПривязкаПакетовКАддендуму.ПолучитьСтруктуруЗаполнения_СоздатьДокумент();
				ПараметрыЗаполнения.Организация = Объект.Участок.Организация;
				ПараметрыЗаполнения.ДатаСмены = Объект.ДатаСмены;
				ПараметрыЗаполнения.Смена = Объект.Смена;
				ПараметрыЗаполнения.СерийныйНомер = Стр.СерийныйНомер;
				
				ПараметрыЗаполнения.АддендумНовый = Объект.Аддендум;
					
				ПараметрыЗаполнения.Ответственный = Пользователи.ТекущийПользователь();	
				
				НовыйДокументПривязкиКАддендуму = Документы.алк_ПривязкаПакетовКАддендуму.СоздатьДокумент();
				НовыйДокументПривязкиКАддендуму.Заполнить(ПараметрыЗаполнения);
				НовыйДокументПривязкиКАддендуму.АддендумСтарый = Стр.ТекущийАддендум;
				
				НовыйДокументПривязкиКАддендуму.Записать(РежимЗаписиДокумента.Проведение);
				 	
			КонецЕсли; 
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		Успех = Ложь;
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат;
	КонецПопытки;
		
	АддендумПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
		
	ОчиститьСообщения();
	
	ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Объект.Участок);
	
	Если ПроверитьЗаполнение()
		И Объект.ДатаСмены = НачалоДня(ПараметрыСменыПоТекущейДате.ДатаСмены) 
		И Объект.Смена = ПараметрыСменыПоТекущейДате.Смена Тогда 			
		СохранитьНаСервере();
		Если Успех Тогда
			АддендумПриИзмененииНаСервере();
			ВопросАсинх("", РежимДиалогаВопрос.ОК, 5, КодВозвратаДиалога.ОК , "Пакеты привязаны/отвязаны к аддендуму", КодВозвратаДиалога.ОК);
			Модифицированность = Ложь;
		КонецЕсли;
	Иначе 
		Если ПараметрыСменыПоТекущейДате <> NULL Тогда 
			ЗаполнитьЗначенияСвойств(Объект, ПараметрыСменыПоТекущейДате, "ДатаСмены, Смена"); 
		КонецЕсли;
		//Объект.СерийныйНомер = Объект.СерийныйНомер.Пустая(); какая-то старая история....
		ВопросАсинх("Ошибка. Проверьте параметры рабочего места и повторно нажмите кнопку ""Сохранить"".", РежимДиалогаВопрос.ОК, , КодВозвратаДиалога.ОК , "Началась новая смена", КодВозвратаДиалога.ОК);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобранныеПакетыПередУдалением(Элемент, Отказ)
	Если НЕ Элементы.ПодобранныеПакеты.ТекущиеДанные.Новый Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АддендумНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокНоменклатур = Новый СписокЗначений;  
	СписокНоменклатур.Добавить(УстановитьНоменклатуруКарандаш());
	СписокНоменклатур.Добавить(Объект.Номенклатура);
	
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;  
	
	ЭлементОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.Номенклатура");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = СписокНоменклатур; 
	
	ПараметрыВыбораФ = Новый Структура;
	ПараметрыВыбораФ.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
	ПараметрыВыбораФ.Вставить("РежимВыбора",Истина);
	ПараметрыВыбораФ.Вставить("МножественныйВыбор",Ложь); 
	
	ОткрытьФорму("Документ.алк_Аддендумы.ФормаВыбора",ПараметрыВыбораФ,
	Элемент, , , ,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьНоменклатуруКарандаш() 
	Возврат Справочники.Номенклатура.НайтиПоКоду("ПБ-00000006");	
КонецФункции
